Case_super_save/Case0/case2/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "system";
 object controlDict;
}

application buoyantPimpleFoam;

startFrom startTime;

startTime 1300;

stopAt endTime;

endTime 1400;

deltaT 0.01;

writeControl timeStep;

writeInterval 10000;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression no;
timeFormat general;

timePrecision 6;

runTimeModifiable yes;
adjustTimeStep no;
maxCo 0.5; 	/*
libs
(
    "libfieldFunctionObjects.so"
    "libFVFunctionObjects.so"
);

functions
{
    volAvgT
    {
        type 			cellSource;
        fields			(T);
        valueOutput		false;
        source 			all;
        operation		volAverage;
        outputControl		outputTime;
        outputInterval		1;
    }
    probes	// point
    {
        type			probes;
        functionObjectLibs	("libsampling.so");
        enabled			true;
        outputControl		outputTime;
        outputInterval		1;
        probeLocations
        (
            ( 1.2 1.6 1.1 )
        );
        fields
        (
            U p T
        );
     }
    floor	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      floor;		// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    ceiling	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    nWall	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    sWall	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    inlet	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
    outlet	// PatchName
    {
        type            faceSource;
        functionObjectLibs ("libfieldFunctionObjects.so");
        enabled         true;
        outputControl   outputTime;	// timeStep
        outputInterval  1;
        log             true;
        valueOutput     false;
        source          patch;
        sourceName      ceiling;	// PatchName
        operation       areaAverage;
        fields
        (
            T
        );
    }
}
*/// ************************************************************************* //

